app/views/employees/edit.html.erb

SELECT "departments".* FROM "departments"
---
  <%= f.label :department %>
  <%= f.collection_select :department_id, Department.all, :id, :name %>