lib/import_csv2.rb

INSERT INTO "employees" ("lastname", "firstname", "email", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["lastname", "Lee"], ["firstname", "James"], ["email", "lee6jj@ucmail.uc.edu"], ["phone", "556.5924"], ["created_at", "2023-03-27 20:35:15.084819"], ["updated_at", "2023-03-27 20:35:15.084819"]]
---
  employee = Employee.new(lastname: row['lastname'], firstname: row['firstname'], email: row['email'], phone: row['phone'], title: row['title'])

  # Save the record to the database
  employee.save