lib/import_departments_csv.rb

INSERT INTO "departments" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2023-03-27 22:16:49.009712"], ["updated_at", "2023-03-27 22:16:49.009712"]]
---
  department = Department.new(name: row['neame'])

  # Save the record to the database
  department.save