app/controllers/departments_controller.rb

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @department = Department.find(params.expect(:id))

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @department = Department.find(params.expect(:id))