app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("lastname", "firstname", "email", "phone", "title", "department", "pronouns", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @employee.update(employee_params)
---
UPDATE "employees" SET "department" = ?, "pronouns" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["department", "Administration"], ["pronouns", ""], ["updated_at", "2023-03-27 22:20:49.662287"], ["id", 3]]

  def destroy
    @employee.destroy
---
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 1]]